microchip-pic-avr-examples/pic18f57q43-audio-record-playback/pic18f57q43-audio-record-playback.X/mcc_generated_files/pin_manager.h
// get/set IO_RD2 aliases
#define IO_RD2_TRIS                 TRISDbits.TRISD2
#define IO_RD2_LAT                  LATDbits.LATD2
#define IO_RD2_PORT                 PORTDbits.RD2
#define IO_RD2_WPU                  WPUDbits.WPUD2
#define IO_RD2_OD                   ODCONDbits.ODCD2
#define IO_RD2_ANS                  ANSELDbits.ANSELD2
#define IO_RD2_SetHigh()            do { LATDbits.LATD2 = 1; } while(0)
#define IO_RD2_SetLow()             do { LATDbits.LATD2 = 0; } while(0)
#define IO_RD2_Toggle()             do { LATDbits.LATD2 = ~LATDbits.LATD2; } while(0)
#define IO_RD2_GetValue()           PORTDbits.RD2
#define IO_RD2_SetDigitalInput()    do { TRISDbits.TRISD2 = 1; } while(0)
#define IO_RD2_SetDigitalOutput()   do { TRISDbits.TRISD2 = 0; } while(0)
#define IO_RD2_SetPullup()          do { WPUDbits.WPUD2 = 1; } while(0)
#define IO_RD2_ResetPullup()        do { WPUDbits.WPUD2 = 0; } while(0)
#define IO_RD2_SetPushPull()        do { ODCONDbits.ODCD2 = 0; } while(0)
#define IO_RD2_SetOpenDrain()       do { ODCONDbits.ODCD2 = 1; } while(0)
#define IO_RD2_SetAnalogMode()      do { ANSELDbits.ANSELD2 = 1; } while(0)
#define IO_RD2_SetDigitalMode()     do { ANSELDbits.ANSELD2 = 0; } while(0)

// get/set IO_RD3 aliases
#define IO_RD3_TRIS                 TRISDbits.TRISD3
#define IO_RD3_LAT                  LATDbits.LATD3
#define IO_RD3_PORT                 PORTDbits.RD3
#define IO_RD3_WPU                  WPUDbits.WPUD3
#define IO_RD3_OD                   ODCONDbits.ODCD3
#define IO_RD3_ANS                  ANSELDbits.ANSELD3
#define IO_RD3_SetHigh()            do { LATDbits.LATD3 = 1; } while(0)
#define IO_RD3_SetLow()             do { LATDbits.LATD3 = 0; } while(0)
#define IO_RD3_Toggle()             do { LATDbits.LATD3 = ~LATDbits.LATD3; } while(0)
#define IO_RD3_GetValue()           PORTDbits.RD3
#define IO_RD3_SetDigitalInput()    do { TRISDbits.TRISD3 = 1; } while(0)
#define IO_RD3_SetDigitalOutput()   do { TRISDbits.TRISD3 = 0; } while(0)
#define IO_RD3_SetPullup()          do { WPUDbits.WPUD3 = 1; } while(0)
#define IO_RD3_ResetPullup()        do { WPUDbits.WPUD3 = 0; } while(0)
#define IO_RD3_SetPushPull()        do { ODCONDbits.ODCD3 = 0; } while(0)
#define IO_RD3_SetOpenDrain()       do { ODCONDbits.ODCD3 = 1; } while(0)
#define IO_RD3_SetAnalogMode()      do { ANSELDbits.ANSELD3 = 1; } while(0)
#define IO_RD3_SetDigitalMode()     do { ANSELDbits.ANSELD3 = 0; } while(0)

// get/set RD5 procedures
#define RD5_SetHigh()            do { LATDbits.LATD5 = 1; } while(0)
#define RD5_SetLow()             do { LATDbits.LATD5 = 0; } while(0)
#define RD5_Toggle()             do { LATDbits.LATD5 = ~LATDbits.LATD5; } while(0)
#define RD5_GetValue()              PORTDbits.RD5
#define RD5_SetDigitalInput()    do { TRISDbits.TRISD5 = 1; } while(0)
#define RD5_SetDigitalOutput()   do { TRISDbits.TRISD5 = 0; } while(0)
#define RD5_SetPullup()             do { WPUDbits.WPUD5 = 1; } while(0)
#define RD5_ResetPullup()           do { WPUDbits.WPUD5 = 0; } while(0)
#define RD5_SetAnalogMode()         do { ANSELDbits.ANSELD5 = 1; } while(0)
#define RD5_SetDigitalMode()        do { ANSELDbits.ANSELD5 = 0; } while(0)

// get/set SST26VF064B_CS aliases
#define SST26VF064B_CS_TRIS                 TRISDbits.TRISD6
#define SST26VF064B_CS_LAT                  LATDbits.LATD6
#define SST26VF064B_CS_PORT                 PORTDbits.RD6
#define SST26VF064B_CS_WPU                  WPUDbits.WPUD6
#define SST26VF064B_CS_OD                   ODCONDbits.ODCD6
#define SST26VF064B_CS_ANS                  ANSELDbits.ANSELD6
#define SST26VF064B_CS_SetHigh()            do { LATDbits.LATD6 = 1; } while(0)
#define SST26VF064B_CS_SetLow()             do { LATDbits.LATD6 = 0; } while(0)
#define SST26VF064B_CS_Toggle()             do { LATDbits.LATD6 = ~LATDbits.LATD6; } while(0)
#define SST26VF064B_CS_GetValue()           PORTDbits.RD6
#define SST26VF064B_CS_SetDigitalInput()    do { TRISDbits.TRISD6 = 1; } while(0)
#define SST26VF064B_CS_SetDigitalOutput()   do { TRISDbits.TRISD6 = 0; } while(0)
#define SST26VF064B_CS_SetPullup()          do { WPUDbits.WPUD6 = 1; } while(0)
#define SST26VF064B_CS_ResetPullup()        do { WPUDbits.WPUD6 = 0; } while(0)
#define SST26VF064B_CS_SetPushPull()        do { ODCONDbits.ODCD6 = 0; } while(0)
#define SST26VF064B_CS_SetOpenDrain()       do { ODCONDbits.ODCD6 = 1; } while(0)
#define SST26VF064B_CS_SetAnalogMode()      do { ANSELDbits.ANSELD6 = 1; } while(0)
#define SST26VF064B_CS_SetDigitalMode()     do { ANSELDbits.ANSELD6 = 0; } while(0)

// get/set channel_MIC2_AND7 aliases
#define channel_MIC2_AND7_TRIS                 TRISDbits.TRISD7
#define channel_MIC2_AND7_LAT                  LATDbits.LATD7
#define channel_MIC2_AND7_PORT                 PORTDbits.RD7
#define channel_MIC2_AND7_WPU                  WPUDbits.WPUD7
#define channel_MIC2_AND7_OD                   ODCONDbits.ODCD7
#define channel_MIC2_AND7_ANS                  ANSELDbits.ANSELD7
#define channel_MIC2_AND7_SetHigh()            do { LATDbits.LATD7 = 1; } while(0)
#define channel_MIC2_AND7_SetLow()             do { LATDbits.LATD7 = 0; } while(0)
#define channel_MIC2_AND7_Toggle()             do { LATDbits.LATD7 = ~LATDbits.LATD7; } while(0)
#define channel_MIC2_AND7_GetValue()           PORTDbits.RD7
#define channel_MIC2_AND7_SetDigitalInput()    do { TRISDbits.TRISD7 = 1; } while(0)
#define channel_MIC2_AND7_SetDigitalOutput()   do { TRISDbits.TRISD7 = 0; } while(0)
#define channel_MIC2_AND7_SetPullup()          do { WPUDbits.WPUD7 = 1; } while(0)
#define channel_MIC2_AND7_ResetPullup()        do { WPUDbits.WPUD7 = 0; } while(0)
#define channel_MIC2_AND7_SetPushPull()        do { ODCONDbits.ODCD7 = 0; } while(0)
#define channel_MIC2_AND7_SetOpenDrain()       do { ODCONDbits.ODCD7 = 1; } while(0)
#define channel_MIC2_AND7_SetAnalogMode()      do { ANSELDbits.ANSELD7 = 1; } while(0)
#define channel_MIC2_AND7_SetDigitalMode()     do { ANSELDbits.ANSELD7 = 0; } while(0)

// get/set RF0 procedures
#define RF0_SetHigh()            do { LATFbits.LATF0 = 1; } while(0)
#define RF0_SetLow()             do { LATFbits.LATF0 = 0; } while(0)
#define RF0_Toggle()             do { LATFbits.LATF0 = ~LATFbits.LATF0; } while(0)
#define RF0_GetValue()              PORTFbits.RF0
#define RF0_SetDigitalInput()    do { TRISFbits.TRISF0 = 1; } while(0)
#define RF0_SetDigitalOutput()   do { TRISFbits.TRISF0 = 0; } while(0)
#define RF0_SetPullup()             do { WPUFbits.WPUF0 = 1; } while(0)
#define RF0_ResetPullup()           do { WPUFbits.WPUF0 = 0; } while(0)
#define RF0_SetAnalogMode()         do { ANSELFbits.ANSELF0 = 1; } while(0)
#define RF0_SetDigitalMode()        do { ANSELFbits.ANSELF0 = 0; } while(0)

// get/set LED0 aliases
#define LED0_TRIS                 TRISFbits.TRISF3
#define LED0_LAT                  LATFbits.LATF3
#define LED0_PORT                 PORTFbits.RF3
#define LED0_WPU                  WPUFbits.WPUF3
#define LED0_OD                   ODCONFbits.ODCF3
#define LED0_ANS                  ANSELFbits.ANSELF3
#define LED0_SetHigh()            do { LATFbits.LATF3 = 1; } while(0)
#define LED0_SetLow()             do { LATFbits.LATF3 = 0; } while(0)
#define LED0_Toggle()             do { LATFbits.LATF3 = ~LATFbits.LATF3; } while(0)
#define LED0_GetValue()           PORTFbits.RF3
#define LED0_SetDigitalInput()    do { TRISFbits.TRISF3 = 1; } while(0)
#define LED0_SetDigitalOutput()   do { TRISFbits.TRISF3 = 0; } while(0)
#define LED0_SetPullup()          do { WPUFbits.WPUF3 = 1; } while(0)
#define LED0_ResetPullup()        do { WPUFbits.WPUF3 = 0; } while(0)
#define LED0_SetPushPull()        do { ODCONFbits.ODCF3 = 0; } while(0)
#define LED0_SetOpenDrain()       do { ODCONFbits.ODCF3 = 1; } while(0)
#define LED0_SetAnalogMode()      do { ANSELFbits.ANSELF3 = 1; } while(0)
#define LED0_SetDigitalMode()     do { ANSELFbits.ANSELF3 = 0; } while(0)

/**
   @Param
    none
   @Returns
    none
   @Description
    GPIO and peripheral I/O initialization
   @Example
    PIN_MANAGER_Initialize();
 */
void PIN_MANAGER_Initialize (void);




#endif // PIN_MANAGER_H
/**
 End of File
*/